# Задача:

# 1. Создайте картеж с разными типами элементов: 
my_info = ('Dima', 'Gerasimchuk', 37, None, False)
# print(my_info)
# print(type(my_info))

# 2. Создайте второй картеж: 
my_names = ('Dmitry', 'Dimas', 'Dmitry Leonidovich')
# print(my_names)
# print(type(my_names))

# 3. Объедините два картежа: 
new_my_info = my_info + my_names
# print(type(new_my_info))

# 4. Выведите результат в терминал:
print(new_my_info)